index.org
#+title: Apache Superset - ressources
#+subtitle: S'approprier le logiciel libre Apache Superset
#+author: Équipe de la mission logiciels libres
#+options: toc:t
#+language: fr

* Ce qui existe
  :PROPERTIES:
  :EXPORT_FILE_NAME: existant.md
  :END:

** Documentation en français

- Documentation MTE :fr: : https://snum.gitlab-pages.din.developpement-durable.gouv.fr/ds/gd3ia/offre-dataviz-documentation/
- DATARAMA 2023 - Open Data et datavisualisation, l'évolution de la transparence gouvernementale : https://www.youtube.com/watch?v=A1SJ5eq3ew0

** Documentation en anglais
  - Documentation officielle : https://superset.apache.org/docs/intro
  - Documentation Preset : https://docs.preset.io/docs/getting-started
  - Posts de blog Preset : https://preset.io/blog/
  - Superset 101 : https://www.youtube.com/watch?v=mAIH3hUoxEE
  - Developing a Apache Superset application for 60k users : https://www.youtube.com/watch?v=3BQBnE8jYsI
  - Advanced Apache Superset for Data Engineers (par Maxime Beauchemin) : https://www.youtube.com/watch?v=Mhai7sVU244
  - 2023 | Visualizing Geospatial Data with Apache Superset - Jan Suleiman https://www.youtube.com/watch?v=fwWJvbFTwGc&ab_channel=FOSS4G

** Outils
  - Superset DSFR :fr: : https://github.com/numerique-gouv/chartsgouv
  - Superset OIDC : https://github.com/dataregion/superset-oidc
  - Connecteur Grist : https://github.com/qleroy/shillelagh-gristapi
  - Connecteur DuckDB : https://github.com/Mause/duckdb_engine

** Instances de démo
  - Instance de démo SSPCLoud : https://chartsgouv.lab.sspcloud.fr/dashboard/list
  - Instance bac à sable SSPCloud : https://superset.lab.sspcloud.fr

** Liens utiles
    - https://code.gouv.fr/sill/detail?name=Apache%20Superset
    - https://github.com/numerique-gouv/chartsgouv
** Liste des intances Superset accessibles dans l'administration

** Salons Tchap

- [[https://www.tchap.gouv.fr/#/room/#Programme10LoutildevisualisationdesdonnesdeltatPuvO4oGZW9:agent.interieur.tchap.gouv.fr][Apache Superset - utilisateurs]]
- Apache Superset - experts et contributeurs
- ([[https://code.gouv.fr/fr/contact/espaces-communication-bluehats/][Où échanger avec les BlueHats?]]

* Ce qui manque
  :PROPERTIES:
  :EXPORT_FILE_NAME: manquant.md
  :END:

- Un guide de déploiement pas à pas en français
- Un guide orienté utilisateurs en français
- Un comparatif Superset / Metabase / [autres]

* Calendrier
  :PROPERTIES:
  :EXPORT_FILE_NAME: calendrier.md
  :END:

- Wébinaire de présentation des composants développés et publiés en septembre 2024
- Wébinaire pour faire un point sur les ressources documentaire pour aider la communauté à continuer d'apprendre
- Wébinaire de mobilisation pour la formation Superset dans l'administration?
- Discuter avec les organisateurs du programme 10% 
- Discuter avec l'opérateur de la DINUM d'un événtuel service de déploiement d'instances Superset
- Une autre journée BlueHats Superset généraliste en présentiel en T2 2025
