index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2024-10-13 dim. 10:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apache Superset - ressources</title>
<meta name="author" content="Équipe de la mission logiciels libres" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Apache Superset - ressources
<br />
<span class="subtitle">S'approprier le logiciel libre Apache Superset</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgde14d97">Ce qui existe</a>
<ul>
<li><a href="#orgbfdcb92">Documentation en français</a></li>
<li><a href="#orgec3aedd">Documentation en anglais</a></li>
<li><a href="#orgfdbc40b">Outils</a></li>
<li><a href="#org7bd5c94">Instances de démo</a></li>
<li><a href="#orgaa5ad32">Liens utiles</a></li>
<li><a href="#orgc040bd5">Salons Tchap et autres espaces de discussion</a></li>
</ul>
</li>
<li><a href="#org11fab60">Ce qui manque</a></li>
<li><a href="#org83ceaea">Calendrier</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgde14d97" class="outline-2">
<h2 id="orgde14d97">Ce qui existe</h2>
<div class="outline-text-2" id="text-orgde14d97">
</div>
<div id="outline-container-orgbfdcb92" class="outline-3">
<h3 id="orgbfdcb92">Documentation en français</h3>
<div class="outline-text-3" id="text-orgbfdcb92">
<ul class="org-ul">
<li>Documentation MTE : <a href="https://snum.gitlab-pages.din.developpement-durable.gouv.fr/ds/gd3ia/offre-dataviz-documentation/">https://snum.gitlab-pages.din.developpement-durable.gouv.fr/ds/gd3ia/offre-dataviz-documentation/</a></li>
<li>DATARAMA 2023 - Open Data et datavisualisation, l'évolution de la transparence gouvernementale : <a href="https://www.youtube.com/watch?v=A1SJ5eq3ew0">https://www.youtube.com/watch?v=A1SJ5eq3ew0</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgec3aedd" class="outline-3">
<h3 id="orgec3aedd">Documentation en anglais</h3>
<div class="outline-text-3" id="text-orgec3aedd">
<ul class="org-ul">
<li>Documentation officielle : <a href="https://superset.apache.org/docs/intro">https://superset.apache.org/docs/intro</a></li>
<li>Documentation Preset : <a href="https://docs.preset.io/docs/getting-started">https://docs.preset.io/docs/getting-started</a></li>
<li>Posts de blog Preset : <a href="https://preset.io/blog/">https://preset.io/blog/</a></li>
<li>Superset 101 : <a href="https://www.youtube.com/watch?v=mAIH3hUoxEE">https://www.youtube.com/watch?v=mAIH3hUoxEE</a></li>
<li>Developing a Apache Superset application for 60k users : <a href="https://www.youtube.com/watch?v=3BQBnE8jYsI">https://www.youtube.com/watch?v=3BQBnE8jYsI</a></li>
<li>Advanced Apache Superset for Data Engineers (par Maxime Beauchemin) : <a href="https://www.youtube.com/watch?v=Mhai7sVU244">https://www.youtube.com/watch?v=Mhai7sVU244</a></li>
<li>Visualizing Geospatial Data with Apache Superset - Jan Suleiman - 2023 : <a href="https://www.youtube.com/watch?v=fwWJvbFTwGc&amp;ab_channel=FOSS4G">https://www.youtube.com/watch?v=fwWJvbFTwGc&amp;ab_channel=FOSS4G</a></li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-orgfdbc40b" class="outline-3">
<h3 id="orgfdbc40b">Outils</h3>
<div class="outline-text-3" id="text-orgfdbc40b">
<ul class="org-ul">
<li>Superset DSFR : <a href="https://github.com/numerique-gouv/chartsgouv">https://github.com/numerique-gouv/chartsgouv</a></li>
<li>Superset OIDC : <a href="https://github.com/dataregion/superset-oidc">https://github.com/dataregion/superset-oidc</a></li>
<li>Connecteur Grist : <a href="https://github.com/qleroy/shillelagh-gristapi">https://github.com/qleroy/shillelagh-gristapi</a></li>
<li>Connecteur DuckDB : <a href="https://github.com/Mause/duckdb_engine">https://github.com/Mause/duckdb_engine</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7bd5c94" class="outline-3">
<h3 id="org7bd5c94">Instances de démo</h3>
<div class="outline-text-3" id="text-org7bd5c94">
<ul class="org-ul">
<li>Instance de démo SSPCLoud : <a href="https://chartsgouv.lab.sspcloud.fr/dashboard/list">https://chartsgouv.lab.sspcloud.fr/dashboard/list</a></li>
<li>Instance bac à sable SSPCloud : <a href="https://superset.lab.sspcloud.fr">https://superset.lab.sspcloud.fr</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaa5ad32" class="outline-3">
<h3 id="orgaa5ad32">Liens utiles</h3>
<div class="outline-text-3" id="text-orgaa5ad32">
<ul class="org-ul">
<li><a href="https://code.gouv.fr/sill/detail?name=Apache%20Superset">https://code.gouv.fr/sill/detail?name=Apache%20Superset</a></li>
<li><a href="https://github.com/numerique-gouv/chartsgouv">https://github.com/numerique-gouv/chartsgouv</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc040bd5" class="outline-3">
<h3 id="orgc040bd5">Salons Tchap et autres espaces de discussion</h3>
<div class="outline-text-3" id="text-orgc040bd5">
<ul class="org-ul">
<li><a href="https://www.tchap.gouv.fr/#/room/%23Programme10LoutildevisualisationdesdonnesdeltatPuvO4oGZW9:agent.interieur.tchap.gouv.fr">Apache Superset - utilisateurs</a></li>
<li><a href="https://code.gouv.fr/fr/contact/espaces-communication-bluehats/">Où échanger avec les BlueHats?</a></li>
<li><a href="https://join.slack.com/t/apache-superset/shared_invite/zt-2hwjpqwyq-~t1IRrTzsIuLAtTiKOSzkg">Slack de la communauté Superset</a> :</li>
<li><a href="https://tchap.gouv.fr/#/room/!ZOqsMXhLQmyRSDSHCr:agent.education.tchap.gouv.fr?via=agent.interieur.tchap.gouv.fr&amp;via=agent.education.tchap.gouv.fr&amp;via=agent.externe.tchap.gouv.fr">Apache Superset - experts et contributeurs</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org11fab60" class="outline-2">
<h2 id="org11fab60">Ce qui manque</h2>
<div class="outline-text-2" id="text-org11fab60">
<ul class="org-ul">
<li>Un guide de déploiement pas à pas en français</li>
<li>Un guide orienté utilisateurs en français</li>
<li>Un comparatif Superset / Metabase / [autres]</li>
<li>La liste des intances Superset accessibles dans l'administration</li>
</ul>
</div>
</div>
<div id="outline-container-org83ceaea" class="outline-2">
<h2 id="org83ceaea">Calendrier</h2>
<div class="outline-text-2" id="text-org83ceaea">
<ul class="org-ul">
<li>Wébinaire de présentation des composants développés et publiés en septembre 2024</li>
<li>Wébinaire pour faire un point sur les ressources documentaire pour aider la communauté à continuer d'apprendre</li>
<li>Wébinaire de mobilisation pour la formation Superset dans l'administration?</li>
<li>Discuter avec les organisateurs du programme 10%</li>
<li>Discuter avec l'opérateur de la DINUM d'un événtuel service de déploiement d'instances Superset</li>
<li>Une autre journée BlueHats Superset généraliste en présentiel en T2 2025</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Équipe de la mission logiciels libres</p>
<p class="date">Created: 2024-10-13 dim. 10:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
